# TODO  Напишите функцию count_letters

def count_letters(text) -> dict:
    text = text.lower()
    res = dict()
    for el in text:
        el = el.lowercase()
        if el not in res:
            res[el] = 1
        else:
            res[el]+=1
    return res

# TODO Напишите функцию calculate_frequency

def calculate_frequency(d)-> dict:
    s = sum(d.values())
    for el in d.keys():
        d[el] = round(d[el]/s,2)

    return d

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""


t = count_letters(main_str)
print(calculate_frequency(t))